app/src/main/assets/yulianglishichaxun.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetHisJiangYuLiangSearch xmlns="http://tempuri.org/">
            <strartDate>string1</strartDate>
            <endDate>string2</endDate>
            <deid>string3</deid>
        </GetHisJiangYuLiangSearch>
    </soap:Body>
</soap:Envelope>